entrega_03/src/performance/test_fork.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 16:55:27(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:55:28(-0300)

--------------------------------------
Metrics for period to: 16:55:30(-0300) (width: 2.392s)
--------------------------------------

http.codes.200: ................................................................ 93
http.request_rate: ............................................................. 44/sec
http.requests: ................................................................. 105
http.response_time:
  min: ......................................................................... 41
  max: ......................................................................... 1341
  median: ...................................................................... 125.2
  p95: ......................................................................... 742.6
  p99: ......................................................................... 907
http.responses: ................................................................ 93
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 16:55:40(-0300) (width: 9.313s)
--------------------------------------

http.codes.200: ................................................................ 322
http.request_rate: ............................................................. 35/sec
http.requests: ................................................................. 321
http.response_time:
  min: ......................................................................... 80
  max: ......................................................................... 1109
  median: ...................................................................... 130.3
  p95: ......................................................................... 889.1
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 322


All VUs finished. Total time: 35 seconds

--------------------------------
Summary report @ 16:56:00(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 19/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 41
  max: ......................................................................... 1790
  median: ...................................................................... 115.6
  p95: ......................................................................... 871.5
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 27876.3
  max: ......................................................................... 30244.9
  median: ...................................................................... 29445.4
  p95: ......................................................................... 30040.3
  p99: ......................................................................... 30040.3